app/controllers/school_classes_controller.rb

  def create
    strong_params = get_params
    @class = SchoolClass.create(strong_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "The history of cheese"], ["room_number", 3], ["created_at", "2020-10-28 23:05:27.250686"], ["updated_at", "2020-10-28 23:05:27.250686"]]